using UnityEngine;
using UnityEngine.SceneManagement;

public class MenuButtons : MonoBehaviour
{
    public GameObject prefab;
    public Transform buttonPosition;

    public string SceneName;

    public void StartRandom()
    {
        SceneManager.LoadScene(SceneName);
    }

    public void StartWithSeed()
    {
        SceneManager.LoadScene(SceneName);
    }
    public void Exit()
    {
        Application.Quit();
    }
    ///Общие кнопки
    //Переход к главному меню
    /*-------------------------------------------------------------------------*/

    ///Кнопки главного меню
    //Начать тестирование

    //Пройти обучение

    //Войти в аккаунт

    //Регистрация

    //Рекорды

    //Выход из игры

    /*-------------------------------------------------------------------------*/

    ///Кнопки регистрации
    //Введите имя и фамилию

    //Введите почту

    //Введите логин

    //Введите пароль и повторите пароль

    //Выберите пол

    //Зарегестрироваться

    /*-------------------------------------------------------------------------*/
    ///Кнопки входа
    //Введите логин

    //Введите пароль

    /*-------------------------------------------------------------------------*/
    ///Кнопки рекордов


}
