using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class MenuButtons : MonoBehaviour
{
    public GameObject prefab;
    public Transform buttonPosition;

    ///Общие кнопки
    //Переход к главному меню
    /*-------------------------------------------------------------------------*/

    ///Кнопки главного меню
    //Начать тестирование

    //Пройти обучение

    //Войти в аккаунт

    //Регистрация

    //Рекорды

    //Выход из игры

    /*-------------------------------------------------------------------------*/

    ///Кнопки регистрации
    //Введите имя и фамилию

    //Введите почту

    //Введите логин

    //Введите пароль и повторите пароль

    //Выберите пол

    //Зарегестрироваться

    /*-------------------------------------------------------------------------*/
    ///Кнопки входа
    //Введите логин

    //Введите пароль

    /*-------------------------------------------------------------------------*/
    ///Кнопки рекордов


}
